{"format": "graph-model", "generatedBy": "2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "15"}, {"size": "15"}, {"size": "2"}]}}}, "outputs": {"pi": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "225"}]}}, "dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/pi/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "225"}]}}}}}, {"name": "StatefulPartitionedCall/model/pi/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "225"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "15"}, {"size": "15"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "2"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_4/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_6/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_7/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_7/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_8/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_8/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_9/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_9/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_10/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_10/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_11/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_11/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_12/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_12/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_13/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_13/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_14/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_14/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv2d_15/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_15/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_16/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv2d_16/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_32/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_32/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_30/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_30/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_28/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_28/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/activation/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/model/conv2d/Conv2D_weights", "StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/activation_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation/Relu", "StatefulPartitionedCall/model/conv2d_1/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_1/Relu", "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_2/Relu", "StatefulPartitionedCall/model/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_3/Relu", "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_1/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_1/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_4/Relu", "StatefulPartitionedCall/model/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_5/Relu", "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_4/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_2/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_2/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_6/Relu", "StatefulPartitionedCall/model/conv2d_4/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_7/Relu", "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_3/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_6/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_3/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_3/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_8/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_3/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_9/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_8/Relu", "StatefulPartitionedCall/model/conv2d_5/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_9/Relu", "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_4/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_8/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/add_4/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_4/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_10/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_4/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_11/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_10/Relu", "StatefulPartitionedCall/model/conv2d_6/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_11/Relu", "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_5/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_10/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_5/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_5/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_12/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_5/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_13/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_12/Relu", "StatefulPartitionedCall/model/conv2d_7/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_13/Relu", "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_6/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_12/Relu"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_6/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_6/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_14/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_6/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_15/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_14/Relu", "StatefulPartitionedCall/model/conv2d_8/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_15/Relu", "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_7/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_14/Relu"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_7/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_7/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_16/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_7/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_17/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_16/Relu", "StatefulPartitionedCall/model/conv2d_9/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_9/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_17/Relu", "StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_8/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_16/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_8/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_8/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_18/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_8/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_19/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_18/Relu", "StatefulPartitionedCall/model/conv2d_10/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_10/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_19/Relu", "StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_9/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_18/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/add_9/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_9/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_20/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_9/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_21/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_20/Relu", "StatefulPartitionedCall/model/conv2d_11/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_11/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_21/Relu", "StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_10/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_20/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_10/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_10/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_22/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_10/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_23/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_22/Relu", "StatefulPartitionedCall/model/conv2d_12/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_12/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_23/Relu", "StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_11/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_22/Relu"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_11/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_11/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_24/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_11/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_25/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_24/Relu", "StatefulPartitionedCall/model/conv2d_13/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_13/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_25/Relu", "StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_12/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_24/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/add_12/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_12/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_26/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_12/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_27/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_26/Relu", "StatefulPartitionedCall/model/conv2d_14/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_14/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_28/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_27/Relu", "StatefulPartitionedCall/model/batch_normalization_28/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_13/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_28/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_26/Relu"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_13/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_28/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_13/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_28/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_13/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_29/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_28/Relu", "StatefulPartitionedCall/model/conv2d_15/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_15/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_30/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_29/Relu", "StatefulPartitionedCall/model/batch_normalization_30/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_14/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_30/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_28/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/add_14/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_30/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_14/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_30/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_14/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_31/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/activation_30/Relu", "StatefulPartitionedCall/model/conv2d_16/Conv2D_weights", "StatefulPartitionedCall/model/conv2d_16/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_32/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/activation_31/Relu", "StatefulPartitionedCall/model/batch_normalization_32/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_15/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_32/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_30/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/add_15/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_32/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_15/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_32/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_15/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_average_pooling2d/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/activation_32/Relu", "StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/global_average_pooling2d/Mean", "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model/pi/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/global_average_pooling2d/Mean", "StatefulPartitionedCall/model/pi/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/pi/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/pi/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/pi/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/model/pi/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": 